[
    {
        "id": 1,
        "english": "Genshin Impact is an open-world action RPG developed by miHoYo, released in September 2020.",
        "chinese": "《原神》是由米哈游开发的开放世界动作RPG，于2020年9月发布。"
    },
    {
        "id": 2,
        "english": "The game features seven major nations, each representing a different element and inspired by real-world cultures.",
        "chinese": "游戏包含七个主要国家，各自代表不同元素，并受现实世界文化启发。"
    },
    {
        "id": 3,
        "english": "Travelers start in Mondstadt, the city of freedom, which is based on Germany and worships the Anemo (wind) Archon, Barbatos.",
        "chinese": "旅行者从蒙德城开始，这是一座以德国为原型的自由之城，信仰风神巴巴托斯。"
    },
    {
        "id": 4,
        "english": "Liyue, the next region, draws inspiration from China and is ruled by the Geo (rock) Archon, Morax (Zhongli).",
        "chinese": "璃月是下一个区域，灵感来源于中国，由岩神摩拉克斯（钟离）统治。"
    },
    {
        "id": 5,
        "english": "Elemental reactions are key to combat, such as combining Hydro (water) and Electro (lightning) to trigger 'Electro-Charged.'",
        "chinese": "元素反应是战斗关键，例如结合水元素和雷元素可触发‘感电’效果。"
    },
    {
        "id": 6,
        "english": "Each character has a unique Elemental Skill (press) and Elemental Burst (hold), which require energy to activate.",
        "chinese": "每个角色都有独特的元素战技（点按）和元素爆发（长按），需要能量激活。"
    },
    {
        "id": 7,
        "english": "The 'Resin' system limits daily progress, as it’s needed to claim rewards from bosses and domains.",
        "chinese": "‘树脂’系统限制每日进度，因为领取首领和秘境奖励需要消耗它。"
    },
    {
        "id": 8,
        "english": "Paimon, your floating companion, is often jokingly called 'emergency food' by the fandom.",
        "chinese": "派蒙是你的漂浮伙伴，玩家常戏称她为‘应急食品’。"
    },
    {
        "id": 9,
        "english": "The 'Wish' system is the gacha mechanic where players spend Primogems to obtain characters and weapons.",
        "chinese": "‘祈愿’系统是抽卡机制，玩家消耗原石获取角色和武器。"
    },
    {
        "id": 10,
        "english": "5-star characters like Diluc or Venti have a 0.6% drop rate, but pity guarantees one after 90 wishes.",
        "chinese": "五星角色（如迪卢克或温迪）基础概率为0.6%，但90抽保底必出。"
    },
    {
        "id": 11,
        "english": "The Spiral Abyss is a challenging endgame dungeon with time-based floors and bi-weekly resets.",
        "chinese": "深境螺旋是高难度终局副本，限时挑战且每两周重置一次。"
    },
    {
        "id": 12,
        "english": "Cooking dishes like 'Sweet Madame' can restore HP, while some provide buffs like increased stamina.",
        "chinese": "烹饪料理（如‘甜甜花酿鸡’）可恢复生命值，部分还能提供体力加成等增益。"
    },
    {
        "id": 13,
        "english": "Characters have friendship levels that unlock backstory lore and profile voice-overs.",
        "chinese": "角色拥有好感度等级，解锁背景故事和语音资料。"
    },
    {
        "id": 14,
        "english": "The 'Teapot Realm' is a housing system where players decorate their own serene space.",
        "chinese": "‘尘歌壶’是家园系统，玩家可装饰自己的静谧空间。"
    },
    {
        "id": 15,
        "english": "Events like 'Lantern Rite' (Liyue) or 'Windblume Festival' (Mondstadt) offer limited-time rewards and lore.",
        "chinese": "活动如‘海灯节’（璃月）或‘风花节’（蒙德）提供限时奖励和剧情。"
    }
]
